{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Building prefix dict from the default dictionary ...\n",
      "Loading model from cache C:\\Users\\Lenovo\\AppData\\Local\\Temp\\jieba.cache\n",
      "Loading model cost 0.407 seconds.\n",
      "Prefix dict has been built successfully.\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "import os\n",
    "\n",
    "from neomodel import StructuredNode, StringProperty, RelationshipTo, config, db\n",
    "\n",
    "import json\n",
    "import jieba\n",
    "import requests\n",
    "\n",
    "\n",
    "config.DATABASE_URL = \"bolt://neo4j:88888888@localhost:7687\"\n",
    "\n",
    "\n",
    "# 初始化实体识别字典\n",
    "def init_entity_dict():\n",
    "    # 从 dict.txt 加载自定义实体词典，每行包括实体及其类型，用制表符 \\t 分隔。\n",
    "    # 将实体名动态添加到 jieba 的分词词典中，便于分词时识别特定领域的实体。\n",
    "    dict_path = \"novel.txt\"\n",
    "    word_dict = [\n",
    "        i.strip(\"\\n\") for i in open(dict_path, \"r\", encoding=\"utf-8\").readlines()\n",
    "    ]\n",
    "    # print(word_dict)\n",
    "\n",
    "    # 实体名称映射到实体类型\n",
    "    entity2type = {}\n",
    "    for word in word_dict:\n",
    "        tmp_list = word.split(\"\\t\")\n",
    "        # print(tmp_list)\n",
    "        if len(tmp_list) == 2:\n",
    "            # 将词典添加到jieba分词的自定义词典中\n",
    "            jieba.add_word(tmp_list[0])\n",
    "            entity2type[tmp_list[0]] = tmp_list[1]\n",
    "    return entity2type\n",
    "\n",
    "\n",
    "entity2type = init_entity_dict()\n",
    "# print(entity2type)\n",
    "\n",
    "\n",
    "# 通过自定义词典获取实体\n",
    "def get_enyity(input_str):\n",
    "    word_cut_dict = []\n",
    "    # 对用户问句进行分词\n",
    "    for word in jieba.cut(input_str.strip()):\n",
    "        if word in entity2type:\n",
    "            # print(word)\n",
    "            word_cut_dict.append(word)\n",
    "    return list(set(word_cut_dict))\n",
    "\n",
    "\n",
    "# 提示词模板\n",
    "PROMPT_TEMPLATE = \"\"\"已知信息：\n",
    "{context} \n",
    "根据上面提供的三元组信息，简洁和专业的来回答用户的问题。如果无法从中得到答案，请你根据你的理解回答用户问题。问题是：{question}\"\"\"\n",
    "\n",
    "\n",
    "PROMPT_TEMPLATE1 = \"\"\"请你用你的已有知识，简洁和专业的来回答用户的问题。如果无法从中得到答案，请你根据你的理解回答用户问题。问题是：{question}\"\"\"\n",
    "\n",
    "\n",
    "# 获取提示词模板\n",
    "def get_prompt(question, context):\n",
    "    # 如果问题和neo4j查询到的上下文都不为空，则拼接出一个提示词，提交给大模型\n",
    "    if len(question) and len(context) > 0:\n",
    "\n",
    "        return PROMPT_TEMPLATE.format(context=context, question=question)\n",
    "    # 如果neo4j查询到的数据为空，则提交问题给大模型\n",
    "    else:\n",
    "        return PROMPT_TEMPLATE1.format(question=question)\n",
    "\n",
    "\n",
    "# 从neo4j查询三元组\n",
    "def search_entity_from_neo4j(question, entities):\n",
    "    triplet_list = []\n",
    "    if not entities:\n",
    "        return get_prompt(question=question, context=\"\")\n",
    "\n",
    "    # 查询三元组\n",
    "    query = \"\"\"\n",
    "    MATCH (a:Entity)-[r]->(b:Entity)\n",
    "    WHERE a.name IN $entity_names\n",
    "    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\n",
    "    \"\"\"\n",
    "    params = {\"entity_names\": entities}\n",
    "    results, meta = db.cypher_query(query, params)\n",
    "\n",
    "    for start_node, relation, end_node in results:\n",
    "        triplet_list.append(f\"({start_node},{relation},{end_node})\")\n",
    "\n",
    "    triplet_list = list(set(triplet_list))  # 去重\n",
    "    return get_prompt(question=question, context=\"\\n\".join(triplet_list)[:4096])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from openai import OpenAI\n",
    "\n",
    "\n",
    "def chat_with_gpt(prompt):\n",
    "    response = client.chat.completions.create(\n",
    "        messages=[\n",
    "            {\"role\": \"system\", \"content\": \"You are a helpful assistant.\"},\n",
    "            {\"role\": \"user\", \"content\": prompt},\n",
    "        ],\n",
    "        model=\"qwen-max\",\n",
    "    )\n",
    "    return response.choices[0].message.content\n",
    "\n",
    "\n",
    "# 单次问答尝试\n",
    "def get_answer(input_str):\n",
    "    input_str = input_str.replace(\" \", \"\").strip()\n",
    "    # 预测实体\n",
    "    entitys = get_enyity(input_str)\n",
    "    print(entitys)\n",
    "    # 如果识别到实体\n",
    "    if entitys:\n",
    "        # 先查询实体相关的三元组，并拼接出提示词\n",
    "        prompt = search_entity_from_neo4j(input_str, entitys)\n",
    "        print(prompt)\n",
    "        # 从大模型获取答案\n",
    "        # 替换prompt的字符串，与GPT完成单次对话\n",
    "        response = chat_with_gpt(prompt)\n",
    "        print(response)\n",
    "        return response\n",
    "    else:\n",
    "        print(\"未识别到实体，直接提交问题给大模型\")\n",
    "        prompt = PROMPT_TEMPLATE1.format(question=input_str)\n",
    "        response = chat_with_gpt(prompt)\n",
    "        print(response)\n",
    "        return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 设置API\n",
    "api_key = \"sk-53b7201e936b457d8802a9f5ca3605b4\"\n",
    "base_url = \"https://dashscope.aliyuncs.com/compatible-mode/v1\"\n",
    "os.environ[\"OPENAI_API_KEY\"] = api_key\n",
    "client = OpenAI(api_key=api_key, base_url=base_url)\n",
    "\n",
    "# 单次对话尝试\n",
    "# input_str = input(\"请输入一些文字: \")\n",
    "# get_answer(input_str)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 尝试多轮对话"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "class InteractiveChat:\n",
    "    def __init__(self, client):\n",
    "        self.client = client\n",
    "        self.messages = [{\"role\": \"system\", \"content\": \"You are a helpful assistant.\"}]\n",
    "\n",
    "    def chat(self, input_str):\n",
    "        input_str = input_str.replace(\" \", \"\").strip()\n",
    "        entitys = get_enyity(input_str)\n",
    "        print(\"Entities:\", entitys)\n",
    "\n",
    "        if entitys:\n",
    "            prompt = search_entity_from_neo4j(input_str, entitys)\n",
    "            print(prompt)\n",
    "        else:\n",
    "            print(\"未识别到实体，直接提交问题给大模型\")\n",
    "            print(prompt)\n",
    "            prompt = PROMPT_TEMPLATE1.format(question=input_str)\n",
    "\n",
    "        self.messages.append({\"role\": \"user\", \"content\": prompt})\n",
    "        response = self.client.chat.completions.create(\n",
    "            messages=self.messages,\n",
    "            model=\"qwen-max\",\n",
    "        )\n",
    "        # print(\"response: \", response)\n",
    "        return response\n",
    "\n",
    "    def clear_history(self):\n",
    "        self.messages = [{\"role\": \"system\", \"content\": \"You are a helpful assistant.\"}]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Chat with GPT. Type 'exit' to end the conversation. Type 'clear' to refresh chat history\n",
      "Entities: ['贾宝玉']\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 4, column: 14, offset: 85} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Entity)} {position: line: 2, column: 30, offset: 30} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Entity)} {position: line: 2, column: 14, offset: 14} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 4, column: 57, offset: 128} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 3, column: 13, offset: 50} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "请你用你的已有知识，简洁和专业的来回答用户的问题。如果无法从中得到答案，请你根据你的理解回答用户问题。问题是：贾宝玉的母亲是？\n",
      "response:\n",
      " ChatCompletion(id='chatcmpl-a919eb5f-4995-92bf-821e-a61f71356599', choices=[Choice(finish_reason='stop', index=0, logprobs=None, message=ChatCompletionMessage(content='贾宝玉的母亲是王夫人。在《红楼梦》中，王夫人是贾政的妻子，贾宝玉的生母。', refusal=None, role='assistant', audio=None, function_call=None, tool_calls=None))], created=1734194305, model='qwen-max', object='chat.completion', service_tier=None, system_fingerprint=None, usage=CompletionUsage(completion_tokens=26, prompt_tokens=54, total_tokens=80, completion_tokens_details=None, prompt_tokens_details=None))\n",
      "GPT: ChatCompletion(id='chatcmpl-a919eb5f-4995-92bf-821e-a61f71356599', choices=[Choice(finish_reason='stop', index=0, logprobs=None, message=ChatCompletionMessage(content='贾宝玉的母亲是王夫人。在《红楼梦》中，王夫人是贾政的妻子，贾宝玉的生母。', refusal=None, role='assistant', audio=None, function_call=None, tool_calls=None))], created=1734194305, model='qwen-max', object='chat.completion', service_tier=None, system_fingerprint=None, usage=CompletionUsage(completion_tokens=26, prompt_tokens=54, total_tokens=80, completion_tokens_details=None, prompt_tokens_details=None))\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 4, column: 14, offset: 85} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Entity)} {position: line: 2, column: 30, offset: 30} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Entity)} {position: line: 2, column: 14, offset: 14} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 4, column: 57, offset: 128} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 3, column: 13, offset: 50} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Entities: ['贾宝玉', '林黛玉']\n",
      "请你用你的已有知识，简洁和专业的来回答用户的问题。如果无法从中得到答案，请你根据你的理解回答用户问题。问题是：贾宝玉和林黛玉的关系是？\n",
      "response:\n",
      " ChatCompletion(id='chatcmpl-ca7979a9-7b00-9f14-8496-51f0a319e972', choices=[Choice(finish_reason='stop', index=0, logprobs=None, message=ChatCompletionMessage(content='贾宝玉的母亲是王夫人。\\n\\n贾宝玉和林黛玉的关系是表兄妹，同时他们也是《红楼梦》中的主要人物之一，彼此之间有着深厚的感情。在小说中，他们的关系还被描绘为一种超越了普通亲戚之情的情感纽带。', refusal=None, role='assistant', audio=None, function_call=None, tool_calls=None))], created=1734194348, model='qwen-max', object='chat.completion', service_tier=None, system_fingerprint=None, usage=CompletionUsage(completion_tokens=55, prompt_tokens=93, total_tokens=148, completion_tokens_details=None, prompt_tokens_details=None))\n",
      "GPT: ChatCompletion(id='chatcmpl-ca7979a9-7b00-9f14-8496-51f0a319e972', choices=[Choice(finish_reason='stop', index=0, logprobs=None, message=ChatCompletionMessage(content='贾宝玉的母亲是王夫人。\\n\\n贾宝玉和林黛玉的关系是表兄妹，同时他们也是《红楼梦》中的主要人物之一，彼此之间有着深厚的感情。在小说中，他们的关系还被描绘为一种超越了普通亲戚之情的情感纽带。', refusal=None, role='assistant', audio=None, function_call=None, tool_calls=None))], created=1734194348, model='qwen-max', object='chat.completion', service_tier=None, system_fingerprint=None, usage=CompletionUsage(completion_tokens=55, prompt_tokens=93, total_tokens=148, completion_tokens_details=None, prompt_tokens_details=None))\n"
     ]
    }
   ],
   "source": [
    "# 启动交互式对话\n",
    "print(\n",
    "    \"Chat with GPT. Type 'exit' to end the conversation. Type 'clear' to refresh chat history\"\n",
    ")\n",
    "interactive_chat = InteractiveChat(client)\n",
    "while True:\n",
    "    input_str = input(\"请输入一些文字: \")\n",
    "    if input_str.lower() == \"exit\":\n",
    "        break\n",
    "    if input_str.lower() == \"clear\":\n",
    "        interactive_chat.clear_history()\n",
    "        print(\"消息记录已清除.\")\n",
    "        continue\n",
    "    response = interactive_chat.chat(input_str)\n",
    "    print(f\"GPT: {response}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 改为用 Langchain 实现"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain_core.output_parsers import StrOutputParser"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "class InteractiveChat:\n",
    "    def __init__(self, model):\n",
    "        self.model = model\n",
    "        self.messages = [{\"role\": \"system\", \"content\": \"You are a helpful assistant.\"}]\n",
    "\n",
    "    def chat(self, input_str):\n",
    "        input_str = input_str.replace(\" \", \"\").strip()\n",
    "        entitys = get_enyity(input_str)\n",
    "        print(\"识别到的实体: \", entitys)\n",
    "\n",
    "        if entitys:\n",
    "            prompt = search_entity_from_neo4j(input_str, entitys)\n",
    "        else:\n",
    "            print(\"未识别到实体，直接提交问题给大模型\")\n",
    "            prompt = PROMPT_TEMPLATE1.format(question=input_str)\n",
    "\n",
    "        print(\"提示词:\", prompt)\n",
    "        chain = self.model | StrOutputParser()\n",
    "        response = chain.invoke(prompt)\n",
    "        self.messages.append({\"role\": \"user\", \"content\": prompt})\n",
    "        self.messages.append({\"role\": \"assistant\", \"content\": response})\n",
    "        print(\"消息记录: \", self.messages)\n",
    "        return response\n",
    "\n",
    "    def clear_history(self):\n",
    "        self.messages = [{\"role\": \"system\", \"content\": \"You are a helpful assistant.\"}]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\Lenovo\\AppData\\Local\\Temp\\ipykernel_20752\\2004184041.py:1: LangChainDeprecationWarning: The class `ChatOpenAI` was deprecated in LangChain 0.0.10 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-openai package and should be used instead. To use it run `pip install -U :class:`~langchain-openai` and import as `from :class:`~langchain_openai import ChatOpenAI``.\n",
      "  llm = ChatOpenAI(api_key=api_key, base_url=base_url, model_name=\"qwen-max\")\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Chat with GPT. Type 'exit' to end the conversation. Type 'clear' to refresh chat history\n",
      "识别到的实体:  ['贾宝玉']\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 4, column: 14, offset: 85} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Entity)} {position: line: 2, column: 30, offset: 30} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Entity)} {position: line: 2, column: 14, offset: 14} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 4, column: 57, offset: 128} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 3, column: 13, offset: 50} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "提示词: 请你用你的已有知识，简洁和专业的来回答用户的问题。如果无法从中得到答案，请你根据你的理解回答用户问题。问题是：贾宝玉的母亲是？\n",
      "消息记录:  [{'role': 'system', 'content': 'You are a helpful assistant.'}, {'role': 'user', 'content': '请你用你的已有知识，简洁和专业的来回答用户的问题。如果无法从中得到答案，请你根据你的理解回答用户问题。问题是：贾宝玉的母亲是？'}, {'role': 'assistant', 'content': '贾宝玉的母亲是王夫人。在《红楼梦》中，王夫人是贾政的妻子，也是贾宝玉的生母。'}]\n",
      "GPT: 贾宝玉的母亲是王夫人。在《红楼梦》中，王夫人是贾政的妻子，也是贾宝玉的生母。\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 4, column: 14, offset: 85} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Entity)} {position: line: 2, column: 30, offset: 30} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownLabelWarning} {category: UNRECOGNIZED} {title: The provided label is not in the database.} {description: One of the labels in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing label name is: Entity)} {position: line: 2, column: 14, offset: 14} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 4, column: 57, offset: 128} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: name)} {position: line: 3, column: 13, offset: 50} for query: '\\n    MATCH (a:Entity)-[r]->(b:Entity)\\n    WHERE a.name IN $entity_names\\n    RETURN a.name AS start_node, type(r) AS relation, b.name AS end_node\\n    '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "识别到的实体:  ['贾宝玉', '林黛玉']\n",
      "提示词: 请你用你的已有知识，简洁和专业的来回答用户的问题。如果无法从中得到答案，请你根据你的理解回答用户问题。问题是：贾宝玉和林黛玉的关系是？\n",
      "消息记录:  [{'role': 'system', 'content': 'You are a helpful assistant.'}, {'role': 'user', 'content': '请你用你的已有知识，简洁和专业的来回答用户的问题。如果无法从中得到答案，请你根据你的理解回答用户问题。问题是：贾宝玉的母亲是？'}, {'role': 'assistant', 'content': '贾宝玉的母亲是王夫人。在《红楼梦》中，王夫人是贾政的妻子，也是贾宝玉的生母。'}, {'role': 'user', 'content': '请你用你的已有知识，简洁和专业的来回答用户的问题。如果无法从中得到答案，请你根据你的理解回答用户问题。问题是：贾宝玉和林黛玉的关系是？'}, {'role': 'assistant', 'content': '贾宝玉和林黛玉是中国古典文学名著《红楼梦》中的主要人物。在小说中，他们之间有着深厚的感情，可以被描述为一种超越普通友情的亲密关系。两人自幼一起长大，情投意合，彼此间存在着浓厚的爱情成分。不过，在整个故事里，由于种种原因（包括家族利益、社会规范等），他们的感情最终没有得到圆满的结果。简而言之，《红楼梦》描绘了贾宝玉与林黛玉之间复杂而深刻的情感纽带。'}]\n",
      "GPT: 贾宝玉和林黛玉是中国古典文学名著《红楼梦》中的主要人物。在小说中，他们之间有着深厚的感情，可以被描述为一种超越普通友情的亲密关系。两人自幼一起长大，情投意合，彼此间存在着浓厚的爱情成分。不过，在整个故事里，由于种种原因（包括家族利益、社会规范等），他们的感情最终没有得到圆满的结果。简而言之，《红楼梦》描绘了贾宝玉与林黛玉之间复杂而深刻的情感纽带。\n"
     ]
    }
   ],
   "source": [
    "llm = ChatOpenAI(api_key=api_key, base_url=base_url, model_name=\"qwen-max\")\n",
    "\n",
    "# 启动交互式对话\n",
    "print(\n",
    "    \"Chat with GPT. Type 'exit' to end the conversation. Type 'clear' to refresh chat history\"\n",
    ")\n",
    "interactive_chat = InteractiveChat(llm)\n",
    "while True:\n",
    "    input_str = input(\"请输入一些文字: \")\n",
    "    if input_str.lower() == \"exit\":\n",
    "        break\n",
    "    if input_str.lower() == \"clear\":\n",
    "        interactive_chat.clear_history()\n",
    "        print(\"消息记录已清除.\")\n",
    "        continue\n",
    "    response = interactive_chat.chat(input_str)\n",
    "    print(f\"GPT: {response}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
